app/Controllers/ApiController.php

SELECT *
FROM `venta`
WHERE `fk_id_cliente` = '6'
AND `estado` = 1
---
    public function getVentaCliente($id)
    {
        $ventas = new VentasModel();
        $ventas->where('fk_id_cliente', $id);
        $ventas->where('estado', 1);
        $resultado['ventas'] = $ventas->find();

SELECT *
FROM `venta`
WHERE `id_venta` = '6'
---
    public function editPlantillaVenta($id)
    {
        $ventasModel = new VentasModel();
        $clientes = new ApiModel();
        $ventasModel->where('id_venta', $id);
        $resultado['ventas'] = $ventasModel->find();