app/Models/ClientesModel.php

SELECT *
FROM `cliente`
WHERE `usuario` = 'nico.salaz' AND `estado` = 1
 LIMIT 1
---
    public function obtenerCliente($usuario)
    {
        $where = "usuario = '" . $usuario . "' AND estado = 1";
        $cliente = $this->where($where)->first();

SELECT *
FROM `cliente`
JOIN `usuario` ON `usuario`.`idUsuario` = `cliente`.`fkidusuario`
WHERE `usuario`.`nombre_usuario` = 'nico.salaz'
AND `cliente`.`estado` = '1'
 LIMIT 1
---
    public function obtenerUsuario($usuario)
    {
        $cliente = $this->select("*")
            ->join("usuario", "usuario.idUsuario = cliente.fkidusuario")
            ->where(["usuario.nombre_usuario = " => $usuario, "cliente.estado = " => '1'])->first();