app/Models/EmpleadoModel.php

SELECT *
FROM `empleado`
JOIN `usuario` ON `usuario`.`idUsuario` = `empleado`.`fkiduser`
WHERE `usuario`.`nombre_usuario` = 'nico.salaz'
AND `empleado`.`estado_actividad` = '1'
 LIMIT 1
---
    public function obtenerEmpleado($usuario)
    {
        $empleado = $this->select("*")
            ->join("usuario", "usuario.idUsuario = empleado.fkiduser")
            ->where(["usuario.nombre_usuario = " => $usuario, "empleado.estado_actividad = " => '1'])->first();